/***************************************************************

 *  类名称：        IPipelineInput

 *  描述：				

 *  作者：          Chico(wuyuanbing)

 *  创建时间：      2020/4/24 18:24:47

 *  最后修改人：

 *  版权所有 （C）:   diandiangames

***************************************************************/


namespace CenturyGame.Core.Pipeline
{
    public interface IPipelineInput
    {
        //--------------------------------------------------------------
        #region Fields
        //--------------------------------------------------------------

        string Desc { get; }

        #endregion

        //--------------------------------------------------------------
        #region Properties & Events
        //--------------------------------------------------------------

        void SetData(string key, System.Object arg);

        T GetData<T>(string key,T defaultVal);

        #endregion

        //--------------------------------------------------------------
        #region Creation & Cleanup
        //--------------------------------------------------------------

        #endregion

        //--------------------------------------------------------------
        #region Methods
        //--------------------------------------------------------------

        #endregion
    }
}
